[
{"book": "The Fellowship of the Ring", "source": "First sentence", "quote": "When Mr. Bilbo Baggins of Bag End announced that he would shortly be celebrating his eleventy-first birthday with a party of special magnificence, there was much talk and excitement in Hobbiton."}, {"book": "The Fellowship of the Ring", "source": "Bilbo's farewell speech", "quote": "I don't know half of you half as well as I should like; and I like less than half of you half as well as you deserve."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "The Road goes ever on and on\nDown from the door where it began.\nNow far ahead the Road has gone,\nAnd I must follow, if I can,\nPursuing it with eager feet,\nUntil it joins some larger way\nWhere many paths and errands meet.\nAnd whither then? I cannot say."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "'It was a compliment,' said Merry Brandybuck, 'and so, of course, not true.'"}, {"book": "The Fellowship of the Ring", "source": "In the story this is a translation of a verse in the Black Speech.", "quote": "Three Rings for the Elven-kings under the sky,\nSeven for the Dwarf-lords in their halls of stone,\nNine for Mortal Men doomed to die,\nOne for the Dark Lord on his dark throne\nIn the Land of Mordor where the Shadows lie.\nOne Ring to rule them all, One Ring to find them,\nOne Ring to bring them all and in the darkness bind them\nIn the Land of Mordor where the Shadows lie."}, {"book": "The Fellowship of the Ring", "source": "Frodo and Gandalf", "quote": "'You say the ring is dangerous, far more dangerous than I guess. In what way?'\n'In many ways,' answered the wizard. 'It is far more powerful than I ever dared to think at first, so powerful that in the end it would utterly overcome anyone of mortal race who possessed it. It would possess him.'"}, {"book": "The Fellowship of the Ring", "source": "Gandalf", "quote": "'Sooner or later, if he is strong or well-meaning to begin with, but neither strength nor good purpose will last. Sooner or later the Dark Power will devour him.'"}, {"book": "The Fellowship of the Ring", "source": "Gandalf", "quote": "He thought the ring was very beautiful, and very useful at need; and if anything was wrong or queer, it was himself. He said that it was \"growing on his mind\", and he was always worrying about it; but he did not suspect that the ring itself was to blame."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "'I wish it need not have happened in my time,' said Frodo.\n'So do I,' said Gandalf, 'and so do all who live to see such times. But that is not for them to decide. All we have to decide is what to do with the time that is given us.'"}, {"book": "The Fellowship of the Ring", "source": "Frodo and Gandalf", "quote": "'What a pity that Bilbo did not stab that vile creature, when he had a chance!'\n'Pity? It was Pity that stayed his hand. Pity, and Mercy: not to strike without need. And he has been well rewarded, Frodo. Be sure that he took so little hurt from the evil, and escaped in the end, because he began his ownership of the Ring so. With Pity.'"}, {"book": "The Fellowship of the Ring", "source": "Gandalf", "quote": "Deserves it! I daresay he does. Many that live deserve death. And some that die deserve life. Can you give it to them? Then do not be too eager to deal out death in judgement. For even the very wise cannot see all ends. I have not much hope that Gollum can be cured before he dies, but there is a chance of it. And he is bound up with the fate of the Ring. My heart tells me that he has some part to play yet, for good or ill, before the end; and when that comes, the pity of Bilbo may rule the fate of many – yours not least."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "'You are wise and powerful. Will you not take the Ring?’\n'No!' cried Gandalf, springing to his feet. 'With that power I should have power too great and terrible. And over me the Ring would gain a power still greater and more deadly.' His eyes flashed and his face was lit as by a fire within. 'Do not tempt me! For I do not wish to become like the Dark Lord himself. Yet the way of the Ring to my heart is by pity, pity for weakness and the desire of strength to do good. Do not tempt me! I dare not take it, not even to keep it safe, unused. The wish to wield it would be too great for my strength. I shall have such need of it. Great perils lie before me.'"}, {"book": "The Fellowship of the Ring", "source": "Frodo, of Bilbo", "quote": "He used often to say there was only one Road; that it was like a great river: its springs were at every doorstep, and every path was its tributary. \"It's a dangerous business, Frodo, going out of your door,\" he used to say. \"You step into the Road, and if you don't keep your feet, there is no knowing where you might be swept off to.\""}, {"book": "The Fellowship of the Ring", "source": "Frodo", "quote": "I don't know, and I would rather not guess."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "Still round the corner there may wait\nA new road or a secret gate,\nAnd though we pass them by today,\nTomorrow we may come this way\nAnd take the hidden paths that run\nTowards the Moon or to the Sun."}, {"book": "The Fellowship of the Ring", "source": "Gildor", "quote": "But it is not your own Shire. Others dwelt here before hobbits were; and others will dwell here again when hobbits are no more. The wide world is all about you: you can fence yourselves in, but you cannot for ever fence it out."}, {"book": "The Fellowship of the Ring", "source": "Gildor", "quote": "Do not meddle in the affairs of wizards, for they are subtle and quick to anger."}, {"book": "The Fellowship of the Ring", "source": "Frodo", "quote": "Go not to the Elves for counsel, for they will say both no and yes."}, {"book": "The Fellowship of the Ring", "source": "Gildor", "quote": "...Seldom give unguarded advice, for advice is a dangerous gift, even from the wise to the wise, and all courses may run ill."}, {"book": "The Fellowship of the Ring", "source": "Frodo and Gildor", "quote": "'But where shall I find courage?' asked Frodo. 'Courage is found in unlikely places,' said Gildor. 'Be of good hope! Sleep now!'"}, {"book": "The Fellowship of the Ring", "source": "Sam speaking of the Elves.", "quote": "'They seem a bit above my likes and dislikes, so to speak,' answered Sam slowly. 'It don't seem to matter what I think about them. They are quite different from what I expected – so old and young, and so gay and sad, as it were.'"}, {"book": "The Fellowship of the Ring", "source": "Frodo", "quote": "'Short cuts make delays, but inns make longer ones.'"}, {"book": "The Fellowship of the Ring", "source": "Sam and Pippin", "quote": "Ho! Ho! Ho! to the bottle I go\nTo heal my heart and drown my woe.\nRain may fall and wind may blow,\nAnd many miles be still to go,\nBut under a tall tree I will lie,\nAnd let the clouds go sailing by."}, {"book": "The Fellowship of the Ring", "source": "Said by Pippin", "quote": "'Sam is an excellent fellow, and would jump down a dragon's throat to save you, if he did not trip over his own feet.'"}, {"book": "The Fellowship of the Ring", "source": "Tom Bombadil to Frodo.", "quote": "'Tell me, who are you, alone, yourself and nameless?'"}, {"book": "The Fellowship of the Ring", "source": "Tom Bombadil", "quote": "'Eldest, that's what I am. Mark my words, my friends: Tom was here before the river and the trees; Tom remembers the first raindrop and the first acorn. He made paths before the Big People, and saw the little People arriving. He was here before the Kings and the graves and the Barrow-wights. When the Elves passed westward, Tom was here already, before the seas were bent. He knew the dark under the stars when it was fearless – before the Dark Lord came from Outside.'"}, {"book": "The Fellowship of the Ring", "source": "", "quote": "There were fortresses on the heights. Kings of little kingdoms fought together, and the young Sun shone like fire on the red metal of their new and greedy swords. There was victory and defeat; and towers fell, fortresses were burned, and flames went up into the sky. Gold was piled on the biers of dead kings and queens; and mounds covered them, and the stone doors were shut; and the grass grew over all."}, {"book": "The Fellowship of the Ring", "source": "Tom Bombadil, speaking of Farmer Maggot", "quote": "There's earth under his old feet, and clay on his fingers; wisdom in his bones, and both his eyes are open."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "Ho! Tom Bombadil, Tom Bombadilo!\nBy water, wood and hill, by reed and willow,\nBy fire, sun and moon, harken now and hear us!\nCome, Tom Bombadil, for our need is near us!"}, {"book": "The Fellowship of the Ring", "source": "Fellowship", "quote": "Then Tom put the Ring round the end of his little finger and held it up to the candlelight. For a moment the hobbits noticed nothing strange about this. Then they gasped. There was no sign of Tom disappearing!"}, {"book": "The Fellowship of the Ring", "source": "", "quote": "That night they heard no noises. But either in his dreams or out of them, he could not tell which, Frodo heard a sweet singing running in his mind: a song that seemed to come like a pale light behind a grey rain-curtain, and growing stronger to turn the veil all to glass and silver, until at last it was rolled back, and a far green country opened before him under a swift sunrise."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "Cold be hand and heart and bone,\nand cold be sleep under stone:\nnever more to wake on stony bed.\nnever, till the Sun fails and the Moon is dead.\nIn the black wind the stars shall die,\nand till on gold here let them lie,\ntill the dark lord lofts his hand\nover dead sea and withered land."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "There is a seed of courage hidden (often deeply, it is true) in the heart of the fattest and most timid hobbit, waiting for some final and desperate danger to make it grow."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "Old Tom Bombadil is a merry fellow,\nBright blue his jacket is, and his boots are yellow.\nNone has ever caught him yet, for Tom, he is the master:\nHis songs are stronger songs, and his feet are faster."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "All that is gold does not glitter,\nNot all those who wander are lost;\nThe old that is strong does not wither,\nDeep roots are not reached by the frost.\nFrom the ashes a fire shall be woken,\nA light from the shadows shall spring;\nRenewed shall be blade that was broken,\nThe crownless again shall be king."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "Gil-galad was an Elven-king.\nOf him the harpers sadly sing:\nthe last whose realm was fair and free\nbetween the Mountains and the Sea.\n\nHis sword was long, his lance was keen,\nhis shining helm afar was seen;\nthe countless stars of heaven's field\nwere mirrored in his silver shield.\n\nBut long ago he rode away,\nand where he dwelleth none can say;\nfor into darkness fell his star\nin Mordor where the shadows are."}, {"book": "The Fellowship of the Ring", "source": "Gandalf to himself, of Frodo", "quote": "He is not half through yet, and to what he will come in the end not even Elrond can foretell. Not to evil, I think. He may become like a glass filled with a clear light for eyes to see that can."}, {"book": "The Fellowship of the Ring", "source": "Gandalf to Frodo", "quote": "But all such places will soon become islands under siege, if things go on as they are going. The Dark Lord is putting forth all his strength."}, {"book": "The Fellowship of the Ring", "source": "Bilbo to Frodo", "quote": "I am sorry: sorry you have come in for this burden; sorry about everything. Don't adventures ever have an end? I suppose not. Someone else always has to carry on the story."}, {"book": "The Fellowship of the Ring", "source": "Bilbo to Frodo, of Rivendell", "quote": "Time doesn't seem to pass here: it just is."}, {"book": "The Fellowship of the Ring", "source": "Elrond", "quote": "...in the wearing of the swift years of Middle-earth the line of Meneldil son of Anárion failed, and the Tree withered, and the blood of the Númenoreans became mingled with that of lesser men. Then the watch upon the walls of Mordor slept, and dark things crept back to Gorgoroth. And on a time evil things came forth, and they took Minas Ithil and abode in it, and they made it into a place of dread; and it is called Minas Morgul, the Tower of Sorcery."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "Seek for the Sword that was broken:\nIn Imladris it dwells;\nThere shall be counsels taken\nStronger than Morgul-spells.\nThere shall be shown a token\nThat Doom is near at hand,\nFor Isildur's Bane shall waken,\nAnd the Halfling forth shall stand."}, {"book": "The Fellowship of the Ring", "source": "Aragorn", "quote": "Many evil things there are that your strong walls and bright swords do not stay. You know little of the lands beyond your bounds. Peace and freedom, do you say? The North would have known them little but for us."}, {"book": "The Fellowship of the Ring", "source": "Aragorn", "quote": "And yet less thanks have we than you. Travellers scowl at us, and countrymen give us scornful names. 'Strider' I am to one fat man who lives within a day's march of foes that would freeze his heart, or lay his little town in ruin, if he were not guarded ceaselessly. Yet we would not have it otherwise. If simple folk are free from care and fear, simple they will be, and we must be secret to keep them so."}, {"book": "The Fellowship of the Ring", "source": "Gandalf to Saruman", "quote": "He that breaks a thing to find out what it is has left the path of wisdom."}, {"book": "The Fellowship of the Ring", "source": "Elrond, of Saruman", "quote": "It is perilous to study too deeply the arts of the Enemy, for good or for ill. But such falls and betrayals, alas, have happened before."}, {"book": "The Fellowship of the Ring", "source": "Glorfindel", "quote": "I think that in the end, if all else is conquered, Bombadil will fall, Last as he was First; and then Night will come."}, {"book": "The Fellowship of the Ring", "source": "Gandalf", "quote": "It is not our part here to take thought only for a season, or for a few lives of Men, or for a passing age of the world. We should seek a final end of this menace, even if we do not hope to make one."}, {"book": "The Fellowship of the Ring", "source": "Elrond", "quote": "We must take a hard road, a road unforeseen. There lies our hope, if hope it be. To walk into peril – to Mordor. We must send the Ring to the Fire."}, {"book": "The Fellowship of the Ring", "source": "Elrond", "quote": "We cannot use the Ruling Ring. That we now know too well. It belongs to Sauron and was made by him alone, and is altogether evil. Its strength, Boromir, is too great for anyone to wield at will, save only those who have already a great power of their own. But for them it holds an even deadlier peril. The very desire of it corrupts the heart."}, {"book": "The Fellowship of the Ring", "source": "Elrond", "quote": "If any of the Wise should with this Ring overthrow the Lord of Mordor, using his own arts, he would then set himself on Sauron's throne, and yet another Dark Lord would appear. And that is another reason why the Ring should be destroyed: as long as it is in the world it will be a danger even to the Wise. For nothing is evil in the beginning. Even Sauron was not so. I fear to take the Ring to hide it. I will not take the Ring to wield it."}, {"book": "The Fellowship of the Ring", "source": "Gandalf", "quote": "Despair is only for those who see the end beyond all doubt. We do not."}, {"book": "The Fellowship of the Ring", "source": "Gandalf", "quote": "Let folly be our cloak, a veil before the eyes of the Enemy! For he is very wise, and weighs all things to a nicety in the scales of his malice. But the only measure that he knows is desire, desire for power; and so he judges all hearts. Into his heart the thought will not enter that any will refuse it, that having the Ring we may seek to destroy it. If we seek this, we shall put him out of reckoning."}, {"book": "The Fellowship of the Ring", "source": "Elrond", "quote": "This quest may be attempted by the weak with as much hope as the strong. Yet such is oft the course of deeds that move the wheels of the world: small hands do them because they must, while the eyes of the great are elsewhere."}, {"book": "The Fellowship of the Ring", "source": "Bilbo", "quote": "I had thought of putting: and he lived happily ever afterwards to the end of his days. It is a good ending, and none the worse for having been used before. Now I shall have to alter that: it does not look like coming true."}, {"book": "The Fellowship of the Ring", "source": "Frodo", "quote": "'I will take the Ring,' he said, 'though I do not know the way.'"}, {"book": "The Fellowship of the Ring", "source": "Elrond", "quote": "This is the hour of the Shire-folk, when they arise from their quiet fields to shake the towers and counsels of the Great. Who of all the Wise could have foreseen it? Or, if they are wise, why should they expect to know it, until the hour has struck?"}, {"book": "The Fellowship of the Ring", "source": "", "quote": "'Faithless is he that says farewell when the road darkens,' said Gimli.\n'Maybe,' said Elrond, 'but let him not vow to walk in the dark, who has not seen the nightfall.'\n'Yet sworn word may strengthen quaking heart,' said Gimli.\n'Or break it,' said Elrond."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "At last Frodo spoke. 'I do not wish to go,' he said; 'but neither do I wish to refuse the advice of Gandalf. I beg that there should be no vote, until we have slept on it. Gandalf will get votes easier in the light of the morning than in this cold gloom. How the wind howls!'\nAt these words all fell into silent thought. They heard the wind hissing among the rocks and trees, and there was a howling and wailing round them in the empty spaces of the night.Suddenly Aragorn leapt to his feet. 'How the wind howls!' he cried. 'It is howling with wolf-voices. The Wargs have come west of the Mountains!'"}, {"book": "The Fellowship of the Ring", "source": "Gandalf following his brief, first confrontation with the Balrog of Moria (having been blown down a flight of stairs)", "quote": "Well, well! That's over! I have done all that I could. But I have met my match, and have nearly been destroyed. But don't stand here! Go on!"}, {"book": "The Fellowship of the Ring", "source": "Gandalf confronting the Balrog of Moria", "quote": "'You cannot pass,' he said. The orcs stood still, and a dead silence fell. 'I am a servant of the Secret Fire, wielder of the flame of Anor. You cannot pass. The dark fire will not avail you, flame of Udûn. Go back to the Shadow! You cannot pass.'"}, {"book": "The Fellowship of the Ring", "source": "Gandalf falling into the chasm above which the Bridge of Khazad-dûm had stood", "quote": "With a terrible cry the Balrog fell forward, and its shadow plunged down and vanished. But even as it fell it swung its whip, and the thongs lashed and curled about the wizard's knees, dragging him to the brink. He staggered and fell, grasped vainly at the stone, and slid into the abyss. 'Fly, you fools!' he cried, and was gone."}, {"book": "The Fellowship of the Ring", "source": "Haldir", "quote": "In nothing is the power of the Dark Lord more clearly shown than in the estrangement that divides all those who still oppose him."}, {"book": "The Fellowship of the Ring", "source": "Haldir to the Fellowship", "quote": "The world is indeed full of peril, and in it there are many dark places; but still there is much that is fair, and though in all lands love is now mingled with grief, it grows perhaps the greater."}, {"book": "The Fellowship of the Ring", "source": "Sam, to Frodo", "quote": "I thought that Elves were all for moon and stars: but this is more elvish than anything I ever heard tell of. I feel as if I was inside a song, if you take my meaning."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "As Frodo prepared to follow him, he laid his hand upon the tree beside the ladder: never before had he been so suddenly and so keenly aware of the feel and texture of a tree's skin and of the life within it. He felt a delight in wood and the touch of it, neither as forester nor as carpenter; it was the delight of the living tree itself."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "'Speak no evil of the Lady Galadriel!' said Aragorn sternly. 'You know not what you say. There is in her and in this land no evil, unless a man bring it hither himself.'"}, {"book": "The Fellowship of the Ring", "source": "Attributed by Sam to his \"old gaffer\"", "quote": "It's the job that's never started as takes longest to finish."}, {"book": "The Fellowship of the Ring", "source": "Galadriel", "quote": "I will not give you counsel, saying do this, or do that. For not in doing or contriving, nor in choosing between this course and another, can I avail; but only in knowing what was and is, and in part also what shall be."}, {"book": "The Fellowship of the Ring", "source": "Galadriel to Frodo", "quote": "You may learn something, and whether what you see be fair or evil, that may be profitable, and yet it may not. Seeing is both good and perilous."}, {"book": "The Fellowship of the Ring", "source": "Frodo and Galadriel", "quote": "'And what do you wish?' he said at last.\n'That what should be shall be,' she answered."}, {"book": "The Fellowship of the Ring", "source": "", "quote": "I do not deny that my heart has greatly desired to ask what you offer. For many long years I had pondered what I might do, should the Great Ring come into my hands, and behold! it was brought within my grasp. The evil that was devised long ago works on in many ways, whether Sauron himself stands or falls. Would not that have been a noble deed to set to the credit of his Ring, if I had taken it by force or fear from my guest?\n'And now at last it comes. You will give me the Ring freely! In place of the Dark Lord you will set up a Queen. And I shall not be dark, but beautiful and terrible as the Morning and the Night! Fair as the Sea and the Sun and the Snow upon the Mountain! Dreadful as the Storm and the Lightning! Stronger than the foundations of the earth. All shall love me and despair!'\nShe lifted up her hand and from the ring that she wore there issued a great light that illumined her alone and left all else dark. She stood before Frodo seeming now tall beyond measurement, and beautiful beyond enduring, terrible and worshipful. Then she let her hand fall, and the light faded, and suddenly she laughed again, and lo! she was shrunken: a slender elf-woman, clad in simple white, whose gentle voice was soft and sad.\n'I pass the test,' she said. 'I will diminish, and go into the West, and remain Galadriel.'"}, {"book": "The Fellowship of the Ring", "source": "Galadriel", "quote": "Did not Gandalf tell you that the rings give power according to the measure of each possessor? Before you could use that power you would need to become far stronger, and to train your will to the domination of others."}, {"book": "The Fellowship of the Ring", "source": "Celeborn", "quote": "Oft it may chance that old wives keep in memory word of things that once were needful for the wise to know."}, {"book": "The Fellowship of the Ring", "source": "Galadriel", "quote": "It is said that the skill of the Dwarves is in their hands rather than in their tongues, yet that is not true of Gimli. For none have ever made to me a request so bold and yet so courteous...I do not foretell, for all foretelling is now vain: on the one hand lies darkness, and on the other only hope. But if hope should not fail, then I say to you, Gimli son of Glóin, that your hands shall flow with gold, and yet over you gold shall have no dominion."}, {"book": "The Fellowship of the Ring", "source": "Gimli", "quote": "'Tell me, Legolas, why did I come on this Quest? Little did I know where the chief peril lay! Truly Elrond spoke, saying that we could not foresee what we might meet upon our road. Torment in the dark was the danger that I feared, and it did not hold me back. But I would not have come, had I known the danger of light and joy.'"}, {"book": "The Fellowship of the Ring", "source": "Gimli", "quote": "'Memory is not what the heart desires. That is only a mirror, be it clear as Kheled-zâram. Or so says the heart of Gimli the Dwarf. Elves may see things otherwise. Indeed I have heard that for them memory is more like to the waking world than to a dream. Not so for Dwarves.'"}, {"book": "The Fellowship of the Ring", "source": "Legolas", "quote": "'Time does not tarry ever,' he said; 'but change and growth is not in all things and places alike. For the Elves the world moves, and it moves both very swift and very slow. Swift, because they themselves change little, and all else fleets by: it is a grief to them. Slow, because they do not count the running years, not for themselves. Yet beneath the Sun all things must wear to an end at last.'"}, {"book": "The Fellowship of the Ring", "source": "", "quote": "'Whoa, Sam Gamgee!' he said aloud. 'Your legs are too short, so use your head!'"}, {"book": "The Fellowship of the Ring", "source": "Frodo", "quote": "It is no good trying to escape you. But I'm glad, Sam. I cannot tell you how glad. Come along! It is plain that we were meant to go together. We will go, and may the others find a safe road!"}, {"book": "The Two Towers", "source": "", "quote": "[At Aragorn's mention of their pursuit of his friends the Halflings, a rider, Eothain, laughs and says in disbelief:] 'Do we walk in legends or on the green earth in the daylight?' [Aragorn responds] 'A man may do both. For not we but those who come after will make the legends of our time.'....\" 'Time is pressing,' said the rider, not heeding Aragorn.\""}, {"book": "The Two Towers", "source": "", "quote": "'How shall a man judge what to do in such times?'\n'As he ever has judged,' said Aragorn. 'Good and ill have not changed since yesteryear; nor are they one thing among Elves and Dwarves and another among Men. It is a man's part to discern them, as much in the Golden Wood as in his own house.'"}, {"book": "The Two Towers", "source": "", "quote": "'The counsel of Gandalf was not founded on foreknowledge of safety, for himself or for others,' said Aragorn. 'There are some things that it is better to begin than to refuse, even though the end may be dark.'"}, {"book": "The Two Towers", "source": "", "quote": "Do not be hasty, that is my motto."}, {"book": "The Two Towers", "source": "", "quote": "Learn now the lore of Living Creatures!\nFirst name the four, the free peoples:\nEldest of all, the elf-children;\nDwarf the delver, dark are his houses;\nEnt the earthborn, old as mountains;\nMan the mortal, master of horses"}, {"book": "The Two Towers", "source": "", "quote": "Not so hasty! You call yourselves hobbits? But you should not go telling just anybody. You'll be letting out your own right names if you're not careful."}, {"book": "The Two Towers", "source": "", "quote": "My name is growing all the time, and I've lived a very long, long time; so my name is like a story. Real names tell you the story of the things they belong to in my language, in the Old Entish as you might say. It is a lovely language, but it takes a very long time to say anything in it, because we do not say anything in it, unless it is worth taking a long time to say, and to listen to."}, {"book": "The Two Towers", "source": "", "quote": "Many of those trees were my friends, creatures I had known from nut and acorn; many had voices of their own that are lost for ever now. And there are wastes of stump and bramble where once there were singing groves. I have been idle. I have let things slip. It must stop!"}, {"book": "The Two Towers", "source": "", "quote": "'Yes, I am white now,' said Gandalf. 'Indeed I am Saruman, one might almost say, Saruman as he should have been.'"}, {"book": "The Two Towers", "source": "Gandalf", "quote": "I was talking aloud to myself. A habit of the old: they choose the wisest person present to speak to; the long explanations needed by the young are wearying."}, {"book": "The Two Towers", "source": "Gandalf", "quote": "He is in great fear, not knowing what mighty one may suddenly appear, wielding the Ring, and assailing him with war, seeking to cast him down and take his place. That we should wish to cast him down and have no one in his place is not a thought that occurs to his mind. That we should try to destroy the Ring itself has not yet entered into his darkest dream."}, {"book": "The Two Towers", "source": "Gandalf", "quote": "It is a comfort not to be mistaken at all points. Do I not know it only too well!"}, {"book": "The Two Towers", "source": "Aragorn, of Gandalf", "quote": "The Dark Lord has Nine. But we have One, mightier than they: the White Rider. He has passed through the fire and the abyss, and they shall fear him. We will go where he leads."}, {"book": "The Two Towers", "source": "", "quote": "'Deep is the abyss that is spanned by Durin's Bridge, and none has measured it,' said Gimli.\n'Yet it has a bottom, beyond light and knowledge,' said Gandalf."}, {"book": "The Two Towers", "source": "Gandalf", "quote": "I threw down my enemy, and he fell from the high place and broke the mountain-side where he smote it in his ruin. Then darkness took me, and I strayed out of thought and time, and I wandered far on roads that I will not tell. Naked I was sent back – for a brief time, until my task is done. And naked I lay upon the mountain-top...I was alone, forgotten, without escape upon the hard horn of the world. There I lay staring upward, while the stars wheeled over, and each day was as long as a life-age of the earth."}, {"book": "The Two Towers", "source": "", "quote": "Where now the horse and the rider? Where is the horn that was blowing?\nWhere is the helm and the hauberk, and the bright hair flowing?\nWhere is the hand on the harpstring, and the red fire glowing?\nWhere is the spring and the harvest and the tall corn growing?\nThey have passed like rain on the mountain, like a wind in the meadow;\nThe days have gone down in the West behind the hills into shadow.\nWho shall gather the smoke of the dead wood burning,\nOr behold the flowing years from the Sea returning?"}, {"book": "The Two Towers", "source": "Gandalf", "quote": "We are all friends here. Or should be; for the laughter of Mordor will be our only reward, if we quarrel."}, {"book": "The Two Towers", "source": "Háma", "quote": "Yet in doubt a man of worth will trust to his own wisdom."}, {"book": "The Two Towers", "source": "", "quote": "'I owe much to Éomer,' said Théoden. 'Faithful heart may have froward tongue.'\n'Say also,' said Gandalf, 'that to crooked eyes truth may wear a wry face.'"}, {"book": "The Two Towers", "source": "", "quote": "I have lived to see strange days. Long we have tended our beasts and our fields, built our houses, wrought our tools, or ridden away to help in the wars of Minas Tirith. And that we called the life of Men, the way of the world. We cared little for what lay beyond the borders of our land. Songs we have that tell of these things, but we are forgetting them, teaching them only to children, as a careless custom. And now the songs have come down among us out of strange places, and walk visible under the Sun."}, {"book": "The Two Towers", "source": "", "quote": "So that is the King of Rohan. A fine old fellow. Very polite."}, {"book": "The Two Towers", "source": "Gandalf", "quote": "The guest who has escaped from the roof, will think twice before he comes back in by the door."}, {"book": "The Two Towers", "source": "", "quote": "'The treacherous are ever distrustful,' answered Gandalf wearily."}, {"book": "The Two Towers", "source": "", "quote": "Often does hatred hurt itself!"}, {"book": "The Two Towers", "source": "", "quote": "Behold, I am not Gandalf the Grey, whom you betrayed. I am Gandalf the White, who has returned from death. You have no colour now, and I cast you from the order and from the Council."}, {"book": "The Two Towers", "source": "", "quote": "Oft evil will shall evil mar."}, {"book": "The Two Towers", "source": "", "quote": "There is nothing that Sauron cannot turn to evil uses."}, {"book": "The Two Towers", "source": "", "quote": "Perilous to us all are the devices of an art deeper than we possess ourselves."}, {"book": "The Two Towers", "source": "", "quote": "Be not too eager to deal out death in the name of justice, fearing for your own safety. Even the wise cannot see all ends."}, {"book": "The Two Towers", "source": "", "quote": "We promises, yes I promise!' said Gollum. 'I will serve the master of the Precious. Good master, good Sméagol,  gollum, gollum!"}, {"book": "The Two Towers", "source": "", "quote": "If the One goes into the Fire, and we are at hand? I ask you, Sam, are we ever likely to need bread again? I think not. If we can nurse our limbs to bring us to Mount Doom, that is all we can do. More than I can, I begin to feel."}, {"book": "The Two Towers", "source": "", "quote": "It had always been a notion of his that the kindness of dear Mr. Frodo was of such a high degree that it must imply a fair measure of blindness. […] Gollum in his own way, and with much more excuse as his acquaintance was much briefer, may have made a similar mistake, confusing kindness and blindness."}, {"book": "The Two Towers", "source": "", "quote": "He had all the injured air of a liar suspected when for once he has told the truth, or part of it."}, {"book": "The Two Towers", "source": "Faramir to Frodo", "quote": "I would not snare even an orc with a falsehood."}, {"book": "The Two Towers", "source": "", "quote": "It's a pity that folk as talk about fighting the Enemy can't let others do their bit in their own way without interfering. He'd be mighty pleased, if he could see you now. Think he'd got a new friend, he would."}, {"book": "The Two Towers", "source": "", "quote": "'For myself,\" said Faramir, \"I would see the White Tree in flower again in the courts of the kings, and the Silver Crown return, and Minas Tirith in peace: Minas Anor again as of old, full of light, high and fair, beautiful as a queen among other queens."}, {"book": "The Two Towers", "source": "", "quote": "War must be, while we defend our lives against a destroyer who would devour all; but I do not love the bright sword for its sharpness, nor the arrow for its swiftness, nor the warrior for his glory. I love only that which they defend."}, {"book": "The Two Towers", "source": "", "quote": "Better mistrust undeserved than rash words."}, {"book": "The Two Towers", "source": "", "quote": "We are truth-speakers, we men of Gondor. We boast seldom, and then perform, or die in the attempt. Not if I found it on the highway would I take it  I said. Even if I were such a man as to desire this thing, and even though I knew not clearly what this thing was when I spoke, still I should take those words as a vow, and be held by them."}, {"book": "The Two Towers", "source": "", "quote": "I am wise enough to know that there are some perils from which a man must flee."}, {"book": "The Two Towers", "source": "", "quote": "The praise of the praiseworthy is above all rewards."}, {"book": "The Two Towers", "source": "", "quote": "'We are lost, lost,' said Gollum. 'No name, no business, no Precious, nothing. Only empty. Only hungry; yes, we are hungry. A few little fishes, nasty bony little fishes, for a poor creature, and they say death. So wise they are; so just, so very just.'"}, {"book": "The Two Towers", "source": "", "quote": "They cannot conquer forever!"}, {"book": "The Two Towers", "source": "", "quote": "Who can now hold the fords when the King of the Nine Riders comes? And other armies will come. I am too late. All is lost. I tarried on the way. All is lost. Even if my errand is performed, no one will ever know. There will be no one I can tell. It will be in vain."}, {"book": "The Two Towers", "source": "", "quote": "Frodo raised his head, and then stood up. Despair had not left him, but the weakness had passed. He even smiled grimly, feeling now as clearly as a moment before he had felt the opposite, that what he had to do, he had to do, if he could, and that whether Faramir or Aragorn or Elrond or Galadriel or Gandalf or anyone else ever knew about it was beside the purpose."}, {"book": "The Two Towers", "source": "", "quote": "The brave things in the old tales and songs, Mr. Frodo: adventures, as I used to call them. I used to think that they were things the wonderful folk of the stories went out and looked for, because they wanted them, because they were exciting and life was a bit dull, a kind of a sport, as you might say. But that's not the way of it with the tales that really mattered, or the ones that stay in the mind. Folk seem to have been just landed in them, usually — their paths were laid that way, as you put it."}, {"book": "The Two Towers", "source": "", "quote": "I never thought of that before! We've got — you've got some of the light of it in that star-glass that the Lady gave you! Why, to think of it, we're in the same tale still! It's going on. Don't the great tales never end?"}, {"book": "The Two Towers", "source": "", "quote": "'No, they never end as tales,' said Frodo. 'But the people in them come, and go when their part's ended. Our part will end later — or sooner.'"}, {"book": "The Two Towers", "source": "", "quote": "'I wonder if we shall ever be put into songs or tales. We're in one, or course; but I mean: put into words, you know, told by the fireside, or read out of a great big book with red and black letters, years and years afterwards. And people will say: \"Let's hear about Frodo and the Ring!\" And they'll say: \"Yes, that's one of my favourite stories. Frodo was very brave. wasn't he, dad?\" \"Yes, my boy, the famousest of the hobbits, and that's saying a lot.\"'"}, {"book": "The Two Towers", "source": "", "quote": "'To hear you somehow makes me as merry as if the story was already written. But you've left out one of the chief characters: Samwise the stouthearted. \"I want to hear more about Sam, dad. Why didn't they put in more of his talk, dad? That's what I like, it makes me laugh. And Frodo wouldn't have got far without Sam, would he, dad?\"'"}, {"book": "The Two Towers", "source": "", "quote": "'We're going on a bit too fast. You and I, Sam, are still stuck in the worst places of the story, and it is all too likely that some will say at this point: \"Shut the book now, dad; we don't want to read any more.\"'"}, {"book": "The Two Towers", "source": "", "quote": "Even Gollum might be good in a tale, better than he is to have by you, anyway... I wonder if he thinks he's the hero or the villain?"}, {"book": "The Two Towers", "source": "", "quote": "For a fleeting moment, could one of the sleepers have seen him, they would have thought that they beheld an old weary hobbit, shrunken by the years that had carried him far beyond his time, beyond friends and kin, and the fields and streams of youth, an old starved pitiable thing."}, {"book": "The Two Towers", "source": "", "quote": "The fleeting moment had passed, beyond recall. 'Sneaking, sneaking!' he hissed. 'Hobbits always so polite, yes. O nice hobbits! Sméagol brings them up secret ways that nobody else could find. Tired he is, thirsty he is, yes thirsty; and he guides them and he searches for paths, and they say sneak, sneak. Very nice friends, O yes my precious, very nice.'"}, {"book": "The Two Towers", "source": "", "quote": "The Ring'll be found, and there'll be no more songs."},  {"book": "The Return of the King", "source": "", "quote": "Tall ships and tall kings, three times three. What brought they out of the foundered land over the flowing sea? Seven stars and seven stones and one white tree."}, {"book": "The Return of the King", "source": "", "quote": "Here do I swear fealty and service to Gondor, and to the Lord and Steward of the realm, to speak and to be silent, to do and to let be, to come and to go, in need or plenty, in peace or war, in living or dying, from this hour henceforth, until my lord release me, or death take me, or the world end."}, {"book": "The Return of the King", "source": "", "quote": "I will not forget it, nor fail to reward that which is given: fealty with love, valour with honour, oath-breaking with vengeance."}, {"book": "The Return of the King", "source": "", "quote": "The rule of no realm is mine, neither of Gondor nor any other, great or small. But all worthy things that are in peril as the world now stands, those are my care. And for my part, I shall not wholly fail of my task, though Gondor should perish, if anything passes through this night that can still grow fair or bear fruit and flower again in days to come. For I also am a steward. Did you not know?"}, {"book": "The Return of the King", "source": "", "quote": "Generous deed should not be checked by cold counsel."}, {"book": "The Return of the King", "source": "Aragorn", "quote": "'The hasty stroke goes oft astray.'"}, {"book": "The Return of the King", "source": "", "quote": "'What do you fear, lady?' he [Aragorn] asked.\n'A cage,' she [Eowyn] said. 'To stay behind bars, until use and old age accept them, and all chance of doing great deeds is gone beyond recall or desire.'"}, {"book": "The Return of the King", "source": "", "quote": "'Merry looked out in wonder upon this strange country, of which he had heard many tales upon their long road. It was a skyless world, in which his eye, through dim gulfs of shadowy air, saw only ever-mounting slopes, great walls of stone behind great walls, and frowning precipices wreathed with mist. He sat for a moment half dreaming, listening to the noise of water, the whisper of dark trees, the crack of stone, and the vast waiting silence that brooded behind all sound. He loved mountains, or he had loved the thought of them marching on the edge of stories brought from far away; but now he was borne down by the insupportable weight of Middle-earth. He longed to shut out the immensity in a quiet room by a fire.'"}, {"book": "The Return of the King", "source": "Dernhelm (Eowyn)", "quote": "Where will wants not, a way opens."}, {"book": "The Return of the King", "source": "", "quote": "You deceive yourself. He would have stretched out his hand to this thing, and taking it he would have fallen. He would have kept it for his own, and when he returned you would not have known your son."}, {"book": "The Return of the King", "source": "", "quote": "'You think, as is your wont, my lord, of Gondor only,' said Gandalf. 'Yet there are other men and other lives, and time still to be. And for me, I pity even his slaves.'"}, {"book": "The Return of the King", "source": "", "quote": "Let us remember that a traitor may betray himself and do good that he does not intend. It can be so, sometimes."}, {"book": "The Return of the King", "source": "", "quote": "In rode the Lord of the Nazgûl. A great black shape against the fires beyond he loomed up, grown to a vast menace of despair. In rode the Lord of the Nazgûl, under the archway that no enemy ever yet had passed, and all fled before his face.\nAll save one. There waiting, silent and still in the space before the Gate, sat Gandalf upon Shadowfax: Shadowfax who alone among the free horses of the earth endured the terror, unmoving, steadfast as a graven image in Rath Dínen.\n\"You cannot enter here,\" said Gandalf, and the huge shadow halted. \"Go back to the abyss prepared for you! Go back! Fall into the nothingness that awaits you and your Master. Go!\"\nThe Black Rider flung back his hood, and behold! he had a kingly crown; and yet upon no head visible was it set. The red fires shone between it and the mantled shoulders vast and dark. From a mouth unseen there came a deadly laughter.\n\"Old fool!\" he said. \"Old fool! This is my hour. Do you not know Death when you see it? Die now and curse in vain!\" And with that he lifted high his sword and flames ran down the blade.\nAnd in that very moment, away behind in some courtyard of the city, a cock crowed. Shrill and clear he crowed, recking nothing of war nor of wizardry, welcoming only the morning that in the sky far above the shadows of death was coming with the dawn.\nAnd as if in answer there came from far away another note. Horns, horns, horns, in dark Mindolluin's sides they dimly echoed. Great horns of the north wildly blowing. Rohan had come at last.”"}, {"book": "The Return of the King", "source": "Théoden", "quote": "'Forth now, and fear no darkness!'"}, {"book": "The Return of the King", "source": "", "quote": "Arise, arise, Riders of Théoden!\nFell deeds awake: fire and slaughter!\nspear shall be shaken, shield be splintered,\na sword-day, a red day, ere the sun rises!\nRide now, ride now! Ride to Gondor!"}, {"book": "The Return of the King", "source": "", "quote": "'Begone foul dwimmerlaik, lord of carrion! Leave the dead in peace!'\nA cold voice answered: 'Come not between the Nazgûl and his prey! Or he will not slay thee in thy turn. He will bear thee away to the houses of lamentation, beyond all darkness, where thy flesh shall be devoured, and thy shriveled mind be left naked to the Lidless Eye.'\nA sword rang as it was drawn. 'Do what you will; but I will hinder it, if I may.'\n'Hinder me? Thou fool. No living man may hinder me!'\nThen Merry heard of all sounds in that hour the strangest.  It seemed that Dernhelm laughed, and the clear voice was like the ring of steel. 'But no living man am I! You look upon a woman. Éowyn I am, Éomund’s daughter. You stand between me and my lord and kin. Begone, if you be not deathless! For living or dark undead, I will smite you if you touch him.'"}, {"book": "The Return of the King", "source": "", "quote": "Great heart will not be denied."}, {"book": "The Return of the King", "source": "", "quote": "Over the field rang his clear voice calling: 'Death! Ride, ride to ruin and the world's ending!'"}, {"book": "The Return of the King", "source": "", "quote": "Out of doubt, out of dark, to the day's rising,\nHe rode singing in the sun, sword unsheathing.\nHope he rekindled, and in hope ended;\nOver death, over dread, over doom lifted\nOut of loss, out of life, unto long glory."}, {"book": "The Return of the King", "source": "Théoden", "quote": "\"My body is broken. I go to my fathers. And even in their mighty company I shall not now be ashamed.\""}, {"book": "The Return of the King", "source": "Denethor", "quote": "Soon all shall be burned. The West has failed. It shall all go up in a great fire, and all shall be ended. Ash! Ash and smoke blown away on the wind!"}, {"book": "The Return of the King", "source": "", "quote": "'Authority is not given to you, Steward of Gondor, to order the hour of your death,' answered Gandalf. 'And only the heathen kings, under the domination of the Dark Power, did thus, slaying themselves in pride and despair, murdering their kin to ease their own death.'"}, {"book": "The Return of the King", "source": "", "quote": "Then suddenly Denethor laughed. He stood up tall and proud again, and stepping swiftly back to the table he lifted from it the pillow on which his head had lain. Then coming to the doorway he drew aside the covering, and lo! he had between his hands a palantír. And as he held it up, it seemed to those that looked on that the globe began to glow with an inner flame, so that the lean face of the Lord was lit as with a red fire, and it seemed cut out of hard stone, sharp with black shadows, noble, proud, and terrible. His eyes glittered.\n'Pride and despair!' he cried. 'Didst thou think that the eyes of the White Tower were blind? Nay, I have seen more than thou knowest, Grey Fool. For thy hope is but ignorance. Go then and labour in healing! Go forth and fight! Vanity. For a little space you may triumph on the field, for a day. But against the Power that now arises there is no victory. To this City only the first finger of its hand has yet been stretched. All the East is moving. And even now the wind of thy hope cheats thee and wafts up Anduin a fleet with black sails. The West has failed. It is time for all to depart who would not be slaves.'"}, {"book": "The Return of the King", "source": "Gandalf", "quote": "To me it would not seem that a Steward who faithfully surrenders his charge is diminished in love or in honour."}, {"book": "The Return of the King", "source": "", "quote": "'So passes Denethor, son of Ecthelion,' said Gandalf. 'And so pass also the days of Gondor... for good or evil they are ended.'"}, {"book": "The Return of the King", "source": "", "quote": "Few other griefs amid the ill chances of this world have more bitterness and shame for a man's heart than to behold the love of a lady so fair and brave that cannot be returned."}, {"book": "The Return of the King", "source": "", "quote": "It is the way of my people to use light words at such times and say less than they mean. We fear to say too much. It robs us of the right words when a jest is out of place."}, {"book": "The Return of the King", "source": "", "quote": "It is best to love first what you are fitted to love, I suppose: you must start somewhere and have some roots, and the soil of the Shire is deep. Still there are things deeper and higher; and not a gaffer could tend his garden in what he calls peace but for them, whether he knows about them or not."}, {"book": "The Return of the King", "source": "", "quote": "The hands of the king are the hands of a healer, and so the rightful king shall be known."}, {"book": "The Return of the King", "source": "", "quote": "You have only a choice of evils; and prudence would counsel you to strengthen such strong places as you have, and there await the onset.\nIt is not our part to master all the tides of the world, but to do what is in us for the succour of those years wherein we are set, uprooting the evil in the fields that we know, so that those who live after may have clean earth to till. What weather they shall have is not ours to rule.\nBut men are better than gates, and no gate will endure against our Enemy if men desert it.\nIf this be jest, then it is too bitter for laughter. Nay, it is the last move in a great jeopardy, and for one side or the other it will bring the end of the game."}, {"book": "The Return of the King", "source": "", "quote": "'Let the Lord of the Black Land come forth! Justice shall be done upon him. For wrongfully he has made war upon Gondor and wrested its lands. Therefore the King of Gondor demands that he should atone for his evils, and depart then for ever. Come forth!'"}, {"book": "The Return of the King", "source": "", "quote": "There rode a tall and evil shape, mounted upon a black horse, if horse it was; for it was huge and hideous, and its face was a frightful mask, more like a skull than a living head, and in the sockets of its eyes and in its nostrils there burned a flame. The rider was robed all in black, and black was his lofty helm; yet this was no Ringwraith but a living man. The Lieutenant of the Tower of Barad-dûr he was, and his name is remembered in no tale; for he himself had forgotten it, and he said: 'I am the Mouth of Sauron.'"}, {"book": "The Return of the King", "source": "The Mouth of Sauron", "quote": "'I have tokens that I was bidden to show to thee – to thee in especial, if thou shouldst dare to come.'"}, {"book": "The Return of the King", "source": "The Mouth of Sauron", "quote": "'He was dear to you, I see. Or else his errand was one that you did not wish to fail? It has. And now he shall endure the slow torment of years, as long and slow as our arts in the Great Tower can contrive, and never be released, unless maybe when he is changed and broken, so that he may come to you, and you shall see what you have done.'"}, {"book": "The Return of the King", "source": "", "quote": "'The Eagles are coming! The Eagles are coming!'"}, {"book": "The Return of the King", "source": "", "quote": "Already the Ring tempted him, gnawing at his will and reason. Wild fantasies arose in his mind; and he saw Samwise the Strong, Hero of the Age, striding with a flaming sword across the darkened land, and armies flocking to his call as he marched to the overthrow of Barad-dûr. And then all the clouds rolled away, and the white sun shone, and at his command the vale of Gorgoroth became a garden of flowers and trees and brought forth fruit. He had only to put on the Ring and claim it for his own, and all this could be.\nIn that hour of trial it was the love of his master that helped most to hold him firm; but also deep down in him lived still unconquered his plain hobbit-sense: he knew in the core of his heart that he was not large enough to bear such a burden, even if such visions were not a mere cheat to betray him. The one small garden of a free gardener was all his need and due, not a garden swollen to a realm; his own hands to use, not the hands of others to command."}, {"book": "The Return of the King", "source": "", "quote": "In western lands beneath the Sun\nthe flowers may rise in Spring,\nthe trees may bud, the waters run,\nthe merry finches sing.\nOr there maybe 'tis cloudless night\nand swaying beeches bear\nthe Elven-stars as jewels white\namid their branching hair.\nThough here at journey's end I lie\nin darkness buried deep,\nbeyond all towers strong and high,\nbeyond all mountains steep,\nabove all shadows rides the Sun\nand Stars for ever dwell:\nI will not say the Day is done,\nnor bid the Stars farewell."}, {"book": "The Return of the King", "source": "", "quote": "'Frodo! Mr. Frodo, my dear!' cried Sam, tears almost blinding him. 'It's Sam, I've come!' He half lifted his master and hugged him to his breast. Frodo opened his eyes.\n'Am I still dreaming?' he muttered. 'But the other dreams were horrible.'\n'You're not dreaming at all, Master,' said Sam. 'It's real. It's me. I've come.'\n'I can hardly believe it,' said Frodo...and he lay back in Sam's gentle arms, closing his eyes, like a child at rest when night-fears are driven away by some loved voice or hand."}, {"book": "The Return of the King", "source": "", "quote": "'They've taken everything, Sam,' said Frodo. 'Everything I had. Do you understand? Everything!...The quest has failed Sam. Even if we get out of here, we can't escape. Only Elves can escape. Away, away out of Middle-earth, far away over the Sea. If even that is wide enough to keep the Shadow out.'\n'No, not everything, Mr. Frodo. And it hasn't failed, not yet. I took it, Mr. Frodo, begging your pardon. And I've kept it safe. It's round my neck now, and a terrible burden it is, too.'...\n'You've got it?' gasped Frodo. 'You've got it here? Sam, you're a marvel!' Then quickly and strangely his tone changed. 'Give it to me!' he cried, standing up, holding out a trembling hand. 'Give it me at once! You can't have it!'\n'All right, Mr. Frodo,' said Sam, rather startled. 'Here it is!' Slowly he drew the Ring out and passed the chain over his head. 'But...you'll find the Ring very dangerous now, and very hard to bear. If it's too hard a job, I could share it with you, maybe?'\n'No, no!' cried Frodo, snatching the Ring and chain from Sam's hands. 'No you won't, you thief!'...\n'O Sam!' cried Frodo. 'What have I said? What have I done? Forgive me! After all you have done. It is the horrible power of the Ring. I wish it had never, never, been found. But don't mind me, Sam. I must carry the burden to the end. It can't be altered. You can't come between me and this doom.'"}, {"book": "The Return of the King", "source": "", "quote": "There, peeping among the cloud-wrack above a dark tor high up in the mountains, Sam saw a white star twinkle for a while. The beauty of it smote his heart, as he looked up out of the forsaken land, and hope returned to him. For like a shaft, clear and cold, the thought pierced him that in the end the Shadow was only a small and passing thing: there was light and high beauty for ever beyond its reach.\nWhere there's a whip there's a will, my slugs."}, {"book": "The Return of the King", "source": "", "quote": "'Come, Mr. Frodo!' he cried. 'I can't carry it for you, but I can carry you and it as well. So up you get! Come on, Mr. Frodo dear! Sam will give you a ride. Just tell him where to go, and he'll go.'"}, {"book": "The Return of the King", "source": "", "quote": "So foot by foot, like small grey insects, they crept up the slope."}, {"book": "The Return of the King", "source": "", "quote": "'Wicked masster!' it hissed. 'Wicked masster cheats us; cheats Sméagol, gollum. He musstn't go that way. He musstn't hurt Preciouss. Give it to Sméagol, yess, give it to us! Give it to uss!'"}, {"book": "The Return of the King", "source": "Frodo to Gollum", "quote": "'Begone, and trouble me no more! If you touch me ever again, you shall be cast yourself into the Fire of Doom.'"}, {"book": "The Return of the King", "source": "", "quote": "'Look out!' cried Sam. 'He'll spring!' He stepped forward, brandishing his sword. 'Quick, Master!' he gasped. 'Go on! Go on! No time to lose. I'll deal with him. Go on!'...\n'Now!' said Sam. 'At last I can deal with you!'...\n'Don't kill us,' he wept. 'Don't hurt us with nassty cruel steel! Let us live, yes, live just a little longer. Lost, lost! We're lost. And when Precious goes we'll die, yes, die into the dust.' He clawed up the ashes of the path with his long fleshless fingers. 'Dusst!' he hissed.\nSam's hand wavered...he could not strike this thing lying in the dust, forlorn, ruinous, utterly wretched. He himself, though only for a little while, had borne the Ring, and now dimly he guessed the agony of Gollum's shrivelled mind and body, enslaved to that Ring, unable to find peace or relief ever in life again...\n'Oh, curse you, you stinking thing!' he said. 'Go away! Be off! I don't trust you, not as far as I could kick you; but be off. Or I shall hurt you, yes, with nasty cruel steel.'"}, {"book": "The Return of the King", "source": "", "quote": "'I have come,' he said. 'But I do not choose now to do what I came to do. I will not do this deed. The Ring is mine!' And suddenly, as he set it on his finger, he vanished from Sam's sight."}, {"book": "The Return of the King", "source": "", "quote": "And far away, as Frodo put on the Ring and claimed it for his own, even in Sammath Naur the very heart of his realm, the Power in Barad-dûr was shaken, and the Tower trembled from its foundations to its proud and bitter crown. The Dark Lord was suddenly aware of him, and his Eye piercing all shadows looked across the plain to the door that he had made; and the magnitude of his own folly was revealed to him in a blinding flash, and all the devices of his enemies were at last laid bare. Then his wrath blazed in consuming flame, but his fear rose like a vast black smoke to choke him. For he knew his deadly peril and the thread upon which his doom now hung."}, {"book": "The Return of the King", "source": "", "quote": "'Precious, precious, precious!' Gollum cried. 'My Precious! O my Precious!' And with that, even as his eyes were lifted up to gloat on his prize, he stepped too far, toppled, wavered for a moment on the brink, and then with a shriek he fell. Out of the depths came his last wail Precious, and he was gone."}, {"book": "The Return of the King", "source": "Frodo", "quote": "'But do you remember Gandalf's words: Even Gollum may have something yet to do? But for him, Sam, I could not have destroyed the Ring. The Quest would have been in vain, even at the bitter end. So let us forgive him! For the Quest is achieved, and now all is over. I am glad you are here with me. Here at the end of all things, Sam.'"}, {"book": "The Return of the King", "source": "", "quote": "'The realm of Sauron is ended!' said Gandalf. 'The Ring-bearer has fulfilled his Quest.'"}, {"book": "The Return of the King", "source": "", "quote": "The world is full enough of hurts and mischances without wars to multiply them."}, {"book": "The Return of the King", "source": "", "quote": "Many folk like to know beforehand what is to be set on the table; but those who have laboured to prepare the feast like to keep their secret; for wonder makes the words of praise louder."}, {"book": "The Return of the King", "source": "", "quote": "This is your realm, and the heart of the greater realm that shall be. The Third Age of the world is ended, and the new age is begun; and it is your task to order its beginning and to preserve what may be preserved. For though much has been saved, much must now pass away."}, {"book": "The Return of the King", "source": "Gandalf on the new found seedling of a new White Tree of Gondor.", "quote": "Who shall say how it comes here in the appointed hour? But this is an ancient hallow, and ere the kings failed or the Tree withered in the court, a fruit must have been set here. For it is said that, though the fruit of the Tree comes seldom to ripeness, yet the life within may then lie sleeping through many long years, and none can foretell the time in which it will awake."}, {"book": "The Return of the King", "source": "", "quote": "I am the daughter of Elrond. I shall not go with him now when he departs to the Havens; for mine is the choice of Lúthien, and as she so have I chosen, both the sweet and the bitter."}, {"book": "The Return of the King", "source": "Gimli to Éomer, on Arwen and Galadriel", "quote": "You have chosen the Evening, but my love is given to the Morning. And my heart forebodes that soon it will pass away for ever."}, {"book": "The Return of the King", "source": "", "quote": "Out of doubt, out of dark, to the day's rising\nhe rode singing in the sun, sword unsheathing.\nHope he rekindled, and in hope ended;\nover death, over dread, over doom lifted\nout of loss, out of life, unto long glory."}, {"book": "The Return of the King", "source": "Conversation of Treebeard, Galadriel and Celeborn; in the movie adaptation of The Lord of the Rings, the part of this in bold was spoken by Galadriel in the introductory words to The Lord of the Rings: The Fellowship of the Ring (2001)", "quote": "[Treebeard said:] \"It is sad that we should meet only thus at the ending. For the world is changing: I feel it in the water, I feel it in the earth, and I smell it in the air. I do not think we shall meet again.\" And Celeborn said: \"I do not know, Eldest.\" But Galadriel said: \"Not in Middle-earth, nor until the lands that lie under the wave are lifted up again. Then in the willow-meads of Tasarinan we may meet in the Spring. Farewell!\""}, {"book": "The Return of the King", "source": "", "quote": "There is no real going back. Though I may come to the Shire, it will not seem the same; for I shall not be the same. I am wounded with knife, sting, and tooth, and a long burden. Where shall I find rest?"}, {"book": "The Return of the King", "source": "", "quote": "'I am with you at present,' said Gandalf, 'but soon I shall not be. I am not coming to the Shire. You must settle its affairs yourselves; that is what you have been trained for. Do you not yet understand? My time is over: it is no longer my task to set things to rights, nor to help folk to do so. And as for you, my dear friends, you will need no help. You are grown up now. Grown indeed very high; among the great you are, and I have no longer any fear at all for any of you.'"}, {"book": "The Return of the King", "source": "", "quote": "'If I hear not allowed much oftener,' said Sam, 'I'm going to get angry.'"}, {"book": "The Return of the King", "source": "", "quote": "If we all got angry together something might be done."}, {"book": "The Return of the King", "source": "", "quote": "You won't rescue Lotho, or the Shire, just by being shocked and sad, my dear Frodo."}, {"book": "The Return of the King", "source": "", "quote": "'I have already done much that you will find it hard to mend or undo in your lives. And it will be pleasant to think of that and set it against my injuries.'\n'Well, if that is what you find pleasure in,' said Frodo, 'I pity you.'"}, {"book": "The Return of the King", "source": "", "quote": "Do not believe him! He has lost all power, save his voice that can still daunt you and deceive you, if you let it. But I will not have him slain. It is useless to meet revenge with revenge: it will heal nothing."}, {"book": "The Return of the King", "source": "", "quote": "You have robbed my revenge of sweetness, and now I must go hence in bitterness, in debt to your mercy. I hate it and you! Well, I go and I will trouble you no more. But do not expect me to wish you health and long life. You will have neither. But that is not my doing. I merely foretell."}, {"book": "The Return of the King", "source": "", "quote": "Still round the corner there may wait\nA new road or a secret gate\nAnd though I oft have passed them by\nThe day will come at last when I\nShall take the hidden paths that run\nWest of the Moon and East of the Sun."}, {"book": "The Return of the King", "source": "", "quote": "I tried to save the Shire, and it has been saved, but not for me. It must often be so, Sam, when things are in danger: some one has to give them up, lose them, so that others may keep them. But you are my heir: all that I had and might have had I leave to you."}, {"book": "The Return of the King", "source": "", "quote": "You will be the Mayor, of course, as long as you want to be, and the most famous gardener in history; and you will read things out of the Red Book, and keep alive the memory of the age that is gone. so that people will remember the Great Danger and so love their beloved land all the more."}, {"book": "The Return of the King", "source": "", "quote": "'Well, here at last, dear friends, on the shores of the Sea comes the end of our fellowship in Middle-earth. Go in peace! I will not say: do not weep; for not all tears are an evil.'"}, {"book": "The Return of the King", "source": "", "quote": "And the ship went out into the High Sea and passed on into the West, until at last on a night of rain Frodo smelled a sweet fragrance on the air and heard the sound of singing that came over the water. And then it seemed to him that as in his dream in the house of Bombadil, the grey rain-curtain turned all to silver glass and was rolled back, and he beheld white shores and beyond them a far green country under a swift sunrise."}, {"book": "The Return of the King", "source": "", "quote": "But Sam turned to Bywater, and so came back up the Hill, as day was ending once more.  And he went on, and there was yellow light, and fire within; and the evening meal was ready, and he was expected.  And Rose drew him in, and set him in his chair, and put little Elanor upon his lap.\nHe drew a deep breath.  \"Well, I'm back,\" he said."}]